import { useRef } from "react"
import React, { forwardRef } from 'react';

const InterestingForUs = forwardRef<HTMLDivElement>((props, ref) => {

    return (
        <div ref={ref} className="interesting-for-us line" id="interesting-for-us">
        <div className="container ">
            <h2 className="h2-auto">Цікаве про нас</h2>
            <div className="interesting-for-us__block">
                <p>Ласкаво просимо до нашого автосалону у Запоріжжі! Ми пропонуємо великий вибір автомобілів різних марок та моделей, щоб кожен клієнт міг знайти свій ідеальний автомобіль.</p>
                <p>Наш автосалон працює на автомобільному ринку Запоріжжя вже деякий час. За цей час ми зарекомендували себе як надійний партнер і професійний дилер. У нас ви знайдете автомобілі преміум-класу.</p>
                <p>Ми надаємо повний спектр послуг, а саме замовити собі авто щоб придбати його зручно, продивитися прайс-лист та головне - записатися на тест-драйв, щоб зрозуміти, сподобається авто, чи ні.</p>
                <p>В нашому автосалоні ви можете розраховувати на професійне обслуговування вашого автомобіля. Ми надаємо широкий спектр послуг, включаючи:</p>
                    <ul>
                        <li>гарантійне обслуговування</li>
                        <li>регулярне технічне обслуговування</li>
                        <li>комп'ютерна діагностика всіх систем автомобіля</li>
                        <li>ремонт ходової частини та двигуна</li>
                        <li>кузовний ремонт та фарбування</li>
                        <li>встановлення додаткового обладнання та аксесуарів</li>
                    </ul>
                <p>Наш автосалон дотримується високих стандартів обслуговування клієнтів. Ми будуємо довгострокові відносини, засновані на взаємній довірі та повазі. Наші спеціалісти завжди готові надати професійні консультації та допомогти у виборі автомобіля.</p>
                <p>Запрошуємо вас відвідати наш автосалон у Запоріжжі за адресою: вул. Перемоги, 123. Ми завжди раді бачити нових клієнтів і зробимо все можливе, щоб ви залишилися задоволені покупкою!</p>
                <p>Наші контакти ви знайдете на формі для зв'зку. До зустрічі та Слава Україні!</p>
            </div>
        </div>
    </div>
    )
})

export default InterestingForUs;